{
    "rule_AddExpiresOrCacheControlHeaders": "Add expires or cache-control headers (>= 95%)",
    "rule_AddExpiresOrCacheControlHeaders_DetailDescription": "The Expires and Cache-Control headers determine how long a browser should keep a resource in its cache. You must therefore use and configure them correctly for CSS style sheets, JavaScript scripts, and images. Ideally, these elements should be retained as long as possible so that the browser no longer requests them from the server. This saves HTTP requests, bandwidth and server power.",
    "rule_AddExpiresOrCacheControlHeaders_Comment": "%s hidden resources",
    "rule_AddExpiresOrCacheControlHeaders_DetailComment": "%s KB has no Expires or Cache-Control header",
    "rule_CompressHttp": "Compress resources (>= 95%)",
    "rule_CompressHttp_DetailDescription": "You can compress the content of HTML pages to minimize bandwidth consumption between the client and the server. All modern browsers (for smartphones, tablets, notebook and desktop computers) accept HTML compressed via gzip or Deflate. The easiest way to do so is to configure the web server so that it compresses the HTML data stream, either on-the-fly or automatically, as it leaves the server. This practice (on-the-fly compression) is only beneficial for a HTML data stream as it is constantly evolving. When possible, we recommend that you manually compress static resources (e.g. CSS and JavaScript libraries) all in one go.",
    "rule_CompressHttp_Comment": "%s compressed resources",
    "description": "Percentage of resources compressed",
    "rule_CompressHttp_DetailComment": "%s KB is not compressed",
    "rule_DomainsNumber": "Limit the number of domains (< 3)",
    "rule_DomainsNumber_DetailDescription": "When a website or online service hosts a web page's components across several domains, the browser has to establish an HTTP connection with every single one. Once the HTML page has been retrieved, the browser calls the sources as it traverses the DOM (Document Object Model). Some resources are essential for the page to work. If they are hosted on another domain which is slow, it may increase the page's render time. You should therefore, when possible, group all resources on a single domain. The only exception to this is for static resources (style sheets, images, etc.), which should be hosted on a separate domain to avoid sending one or multiple cookies for each browser GET HTTP request. This reduces response time and unnecessary bandwidth consumption.",
    "rule_DomainsNumber_Comment": "%s domain(s) found",
    "rule_DontResizeImageInBrowser": "Do not resize images in the browser",
    "rule_DontResizeImageInBrowser_DetailDescription": "Do not resize images using HTML height and width attributes. Doing so sends images in their original size, wasting bandwidth and CPU power.A PNG-24 350 x 300 px image is 41 KB. If you resized the same image file using HTML, and displayed it as a 70 x 60 px thumbnail, it would still be 41 KB, when in reality it should be no more than 3 KB! Meaning 38 KB downloaded for nothing. The best solution is to resize images using software such as Photoshop, without using HTML. When content added by the website's users has no specific added value, it is best to prevent them from being able to insert images using a WYSIWYG editor e.g. CKEditor.",
    "rule_DontResizeImageInBrowser_Comment": "%s resized image(s) in the browser",
    "rule_DontResizeImageInBrowser_DetailComment": "%s is resized from %s to %s",
    "rule_EmptySrcTag": "Avoid empty SRC tags",
    "rule_EmptySrcTag_DetailDescription": "If there is an image tag with an empty src attribute, the browser will call the directory in which the page is located, generating unnecessary, additional HTTP requests.",
    "rule_EmptySrcTag_DefaultComment": "No empty SRC tag",
    "rule_EmptySrcTag_Comment": "%s empty SRC tag(s)",
    "rule_ExternalizeCss": "Externalize css",
    "rule_ExternalizeCss_DetailDescription": "Ensure that CSS files is separate from the page's HTML code. If you include CSS in the body of the HTML file, and it is used for several pages (or even the whole website), then the code must be sent for each page requested by the user, therefore increasing the volume of data sent. However, if the CSS file is in their own separate files, the browser can avoid requesting them again by storing them in its local cache.",
    "rule_ExternalizeCss_DefaultComment": "No inline stylesheet",
    "rule_ExternalizeCss_Comment": "%s inline stylesheet(s)",
    "rule_ExternalizeJs": "Externalize js",
    "rule_ExternalizeJs_DetailDescription": "Ensure that JavaScript code is separate from the page's HTML code, with the exception of any configuration variables for JavaScript objects. If you include JavaScript code in the body of the HTML file, and it is used for several pages (or even the whole website), then the code must be sent for each page requested by the user, therefore increasing the volume of data sent. However, if the JavaScript code are in their own separate files, the browser can avoid requesting them again by storing them in its local cache.",
    "rule_ExternalizeJs_DefaultComment": "No JavaScript inline",
    "rule_ExternalizeJs_Comment": "%s inline javascript(s)",
    "rule_HttpError": "Avoid error requests",
    "rule_HttpError_DetailDescription": "Error requests consume resources unnecessarily.",
    "rule_HttpError_Comment": "%s HTTP error(s)",
    "rule_HttpRequests": "Limit the number of HTTP requests (< 27)",
    "rule_HttpRequests_DetailDescription": "A page's download time client-side directly correlates to the number and size of files the browser has to download. For each file, the browser sends a GET HTTP to the server. It waits for the response, and then downloads the resource as soon as it is available. Depending on the type of web server you use, the more requests per page there are, the fewer pages the server can handle. Reducing the number of requests per page is key to reducing the number of HTTP severs needed to run the website, and consequently its environmental impact.",
    "rule_HttpRequests_Comment": "%s HTTP request(s)",
    "rule_ImageDownloadedNotDisplayed": "Do not download images unnecessarily",
    "rule_ImageDownloadedNotDisplayed_DetailDescription": "Downloading images that will not necessarily be visible consumes resources unnecessarily. These include, for example, images that are only displayed following a user action.",
    "rule_ImageDownloadedNotDisplayed_Comment": "%s image(s) downloaded but not displayed on the page",
    "rule_ImageDownloadedNotDisplayed_DetailComment": "%s of size %s is not displayed",
    "rule_JsValidate": "Validate javascript",
    "rule_JsValidate_DetailDescription": "JSLint is a code quality control tool that verifies that the JavaScript syntax used will be understood by all browsers. The code produced therefore conforms to coding rules that allow interpreters to execute the code quickly and easily. The processor is therefore used for a shorter time.",
    "rule_JsValidate_DefaultComment": "Javascript validated",
    "rule_JsValidate_Comment": "%s javascript error(s)",
    "rule_MaxCookiesLength": "Maximum size of cookies per domain (< 512 Bytes)",
    "rule_MaxCookiesLength_DetailDescription": "The cookie length should be reduced because it is sent on every request.",
    "rule_MaxCookiesLength_DefaultComment": "No cookies",
    "rule_MaxCookiesLength_Comment": "Maximum size = %s Bytes",
    "rule_MaxCookiesLength_DetailComment": "Cookie of length %s for domain %s",
    "rule_MinifiedCss": "Minify css (>= 95%)",
    "rule_MinifiedCss_DetailDescription": "Use a tool like YUI Compressor to remove unnecessary spaces and line breaks. Google's Apache mod_pagespeed can also automate this operation.",
    "rule_MinifiedCss_DefaultComment": "No css",
    "rule_MinifiedCss_Comment": "%s% minified css",
    "rule_MinifiedCss_DetailComment": "%s should be minified",
    "rule_MinifiedJs": "Minify js (>= 95%)",
    "rule_MinifiedJs_DetailDescription": "Use a tool like YUI Compressor to remove unnecessary spaces, line breaks, semicolons, and shorten local variable names. This can be automated using Google's Apache mod_pagespeed module .",
    "rule_MinifiedJs_DefaultComment": "No js",
    "rule_MinifiedJs_Comment": "%s% minified js",
    "rule_MinifiedJs_DetailComment": "%s should be minified",
    "rule_NoCookieForStaticRessources": "No cookies for static resources",
    "rule_NoCookieForStaticRessources_DetailDescription": "For static resources, a cookie is unnecessary, so it consumes bandwidth unnecessarily. To avoid this, we can use a different domain for static resources or restrict the scope of cookies created",
    "rule_NoCookieForStaticRessources_DefaultComment": "No cookies",
    "rule_NoCookieForStaticRessources_Comment": "%s static resource(s) with a cookie (In total %s KB)",
    "rule_NoCookieForStaticRessources_DetailComment": "%s has cookie(s)",
    "rule_NoRedirect": "Avoid redirects",
    "rule_NoRedirect_DetailDescription": "Redirects should be avoided whenever it is possible as they slow down the response and consume resources unnecessarily.",
    "rule_NoRedirect_Comment": "%s redirect(s)",
    "rule_OptimizeBitmapImages": "Optimize bitmap images",
    "rule_OptimizeBitmapImages_DefaultComment": "No bitmap images to optimize",
    "rule_OptimizeBitmapImages_DetailDescription": "Bitmap images often make up the majority of bytes downloaded, just ahead of CSS and JavaScript libraries. So optimizing them has a huge impact on bandwidth consumed.",
    "rule_OptimizeBitmapImages_Comment": "%s image(s) probably to be optimized, estimated minimum gain: %s KB",
    "rule_OptimizeBitmapImages_DetailComment": "%s KB %s, possibility of winning %s KB",
    "rule_OptimizeSvg": "Optimize svg images",
    "rule_OptimizeSvg_DefaultComment": "No svg to optimize",
    "rule_OptimizeSvg_DetailDescription": "Svg images are less heavy than bitmap images, they can however be optimized and minified by using tools (for example svgo)",
    "rule_OptimizeSvg_Comment": "%s image(s) to optimize",
    "rule_OptimizeSvg_DetailComment": "%s could be optimized (%s KB)",
    "rule_Plugins": "Do not use plugins",
    "rule_Plugins_DetailDescription": "Avoid using plugins (Flash Player, Java and Silverlight virtual machines, etc.) because they can be a heavy drain on resources (CPU and RAM). This is especially true with Adobe's Flash Player, to such an extent that Apple decided to not install the technology on its mobile devices to maximize battery life. Favor standard technology such as HTML5 and ECMAScript.",
    "rule_Plugins_DefaultComment": "No plugins",
    "rule_Plugins_Comment": "%s plugin(s)",
    "rule_PrintStyleSheet": "Provide a css print",
    "rule_PrintStyleSheet_DetailDescription": "In addition to the benefits for the user, this style sheet reduces the number of pages printed, and therefore indirectly minimizes the website's ecological footprint. It should be as streamlined as possible and employ an ink-light typeface e.g. Century Gothic. Also consider hiding the header, footer, menu and sidebar, as well as deleting all images except those needed for content. This print style sheet makes for a cleaner print by trimming down what is displayed on the screen.",
    "rule_PrintStyleSheet_DefaultComment": "No css print",
    "rule_PrintStyleSheet_Comment": "%s print css",
    "rule_SocialNetworkButton": "Do not use standard social network buttons",
    "rule_SocialNetworkButton_DetailDescription": "Social networks such as Facebook, Twitter, Pinterest, etc. provide plugins to install on a WEB page to display a share button and a like counter. These plugins consume resources unnecessarily, it is better to put direct links",
    "rule_SocialNetworkButton_DefaultComment": "No standard social network button found",
    "rule_SocialNetworkButton_Comment": "%s standard button(s) found",
    "rule_SocialNetworkButton_detailComment": "A %s script was found",
    "rule_StyleSheets": "Limit the number of css files (<3)",
    "rule_StyleSheets_DetailDescription": "Minimize the number of CSS files to reduce the number of HTTP requests. If several style sheets are used on all of the website's pages, concatenate them into one single file. Some CMS and frameworks offer ways to do such optimization automatically.",
    "rule_StyleSheets_DefaultComment": "No more than 2 css files",
    "rule_StyleSheets_Comment": "%s css files",
    "rule_UseETags": "Use ETags (>= 95%)",
    "rule_UseETags_DetailDescription": "An ETag is a signature attached a server response. If the client requests a URL (HTML page, image, style sheet, etc.) whose ETag is identical to the one it already has, the web server will reply that it does not need to download the resource and that it should use the one it already possesses. Using ETags saves huge amounts of bandwidth.",
    "rule_UseETags_Comment": "%s resources using ETags",
    "rule_UseETags_DetailComment": "%s Ko does not use ETags",
    "rule_UseStandardTypefaces": "Use standard fonts",
    "rule_UseStandardTypefaces_DetailDescription": "Use standard typefaces as they already exist on the user's computer, and therefore do not need to be downloaded. This saves bandwidth and improves the website's render time.",
    "rule_UseStandardTypefaces_DefaultComment": "No specific fonts",
    "rule_UseStandardTypefaces_Comment": "%s KB of specific character font(s)",
    "date": "Date",
    "hostname": "Hostname",
    "platform": "Platform",
    "connection": "Connection",
    "grade": "Grade",
    "ecoIndex": "EcoIndex",
    "nbPages": "Number of pages",
    "timeout": "Timeout",
    "nbConcAnalysis": "Number of concurrent analysis",
    "nbAdditionalAttemps": "Number of additional attempts in case of failure",
    "nbErrors": "Number of analysis errors",
    "analysisErrors": "Analysis errors:",
    "priorityPages": "Priority pages:",
    "rulesToApply": "Rules to apply:",
    "url": "URL",
    "water": "Water (cl)",
    "greenhouseGasesEmission": "GHG (gCO2e)",
    "domSize": "DOM size",
    "pageSize": "Page size (Ko)",
    "nbRequests": "Number of requests",
    "nbPlugins": "Number of plugins",
    "nbCssFiles": "Number of CSS files",
    "nbInlineCss": "Number of \"inline\" CSS",
    "nbEmptySrc": "Number of empty \"src\" tags",
    "nbInlineJs": "Number of \"inline\" JS",
    "resizedImage": "Resized image in browser:",
    "bestPractices": "Best practices",
    "mobile": "Mobile",
    "wired": "Wired",
    "noData": "No data",
    "greenItAnalysisReport": "GreenIT-Analysis report",
    "executionDate": "Execution date",
    "scenarios": "Scenario(s)",
    "errors": "Error(s)",
    "error": "Error",
    "scenario": "Scenario",
    "shareDueToActions": "Share due to actions",
    "bestPracticesToImplement": "Best practices to implement",
    "priority": "Priority",
    "allPriorities": "All priorities",
    "bestPractice": "Best practice",
    "effort": "Effort",
    "impact": "Impact",
    "note": "Grade",
    "footerEcoIndex": "To understand the EcoIndex calculation:",
    "footerBestPractices": "Among the 115 ecodesign best practices, 24 are verified by the tool. To know more:",
    "tooltip_ecoIndex": "Environmental performance is represented by a score out of 100 and a grade from A to G (the higher the grade, the better!). The EcoIndex is that of the page, actions included.",
    "tooltip_shareDueToActions": "[EcoIndex when opening the page] - [EcoIndex after execution of actions], this part is included in the EcoIndex.",
    "tooltip_bestPracticesToImplement": "Number of ecodesign best practices to be implemented per page out of the 24 analyzed by the tool.",
    "requests": "Requests",
    "steps": "Steps",
    "step": "Step",
    "result": "Result",
    "trend": "Trend",
    "bestPracticesToImplementWithNumber": "Best practices (%d to implement)",
    "pageLoading": "Page loading"
}
